# coding=utf-8

''' 元祖是不可修改的，类似于常数
        这个不可修改性，只是针对于元组本身顶层，而元组中嵌套结构内，是可以修改的
'''

''' 初始化
'''
t = tuple('spam')

''' 包含一个元素，必须有一个逗号
    容易引起歧义：
        圆括号可以把表达式括起来
        如果要得到一个元组，必须特别说明，使用一个逗号
'''
t = (0, )
t = ()

t = (0, 1, 2, 3)
t = 0, 1, 2, 3

''' 注意，这里生成的是tuple，而不是list
'''
t = [x ** 2 for x in range(4)]

##############################################################################################################
''' 基本操作
'''
dimensions = (200, 50)

print(dimensions.index(50))
print(dimensions.count(100))

# 省略了括号，仍然定义的是一个元组
data = 1, 2
print(type(data))

t = (1, 2) + (3, 4)
print(t)


##############################################################################################################
''' 列表解析
    生成的时迭代器
'''
iter = (x for x in range(10))
t = tuple(iter)
print(t)

# l = list(iter)
# print(l)

