#!/bin/bash
#set -x

#######################################################
# 捕获脚本的退出
trap "echo Goodbye..." EXIT


#######################################################
# 将当前控制台的后台运行  
# 5_control.sh &
#	1. 最好是将后台运行的脚本的STDOUT和STDERR进行重定向，避免杂乱的输出
#	2. ps -f 每一个后台进程都和终端会话（pts/0）终端联系在一起，终端退出时后台进程也会退出

# 非控制台运行脚本
# nohup ./test1.sh &
#	1. nohup 运行了另外一个命令，来阻断所有发送给该进程的SIGHUP信号。这会在退出终端会话时阻止进程退出
#	2. STDOUT和STDERR的消息重定向到一个名为nohup.out的文件中

#######################################################
# 定期执行的作业，cron
# 	1. 设置时间，运行脚本 crontab -e  
# 	2. 预配置的脚本目录：ls /etc/cron.*ly
# 	3. anacron可以执行因为关机错误的任务
